       IDENTIFICATION DIVISION.
       PROGRAM-ID. RPT6000.
      ****************************************************************
      * PROGRAM NAME: RPT6000
      * AUTHORS: Jacob Schamp
      * DATE: 03/25/2026
      * Github:
      * DESCRIPTION: The program reads customer master records and
      * produces a Year-To-Date Sales report. It then prints customer
      * sales for the current and previous year, calculates the
      * change amount and percentage, and displays salesrep totals,
      * branch totals, and grand totals.
      ****************************************************************

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT I_CUSTMAST ASSIGN TO CUSTMAST.
           SELECT O_RPT6000 ASSIGN TO RPT6000.

       DATA DIVISION.
       FILE SECTION.

       FD  I_CUSTMAST
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 130 CHARACTERS
           BLOCK CONTAINS 130 CHARACTERS.

       01  CUSTOMER-MASTER-RECORD.
           05 CM-BRANCH-NUMBER       PIC 9(2).
           05 CM-SALESREP-NUMBER     PIC 9(2).
           05 CM-CUSTOMER-NUMBER     PIC 9(5).
           05 CM-CUSTOMER-NAME       PIC X(20).
           05 CM-SALES-THIS-YTD      PIC S9(5)V99.
           05 CM-SALES-LAST-YTD      PIC S9(5)V99.
           05 FILLER                 PIC X(87).

       01  WS-SALESREP-RECORD.
           05 SM-SALESREP-NUMBER     PIC 9(2).
           05 SM-SALESREP-NAME       PIC X(10).
           05 FILLER                 PIC X(118).

       FD  O_RPT6000
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 130 CHARACTERS
           BLOCK CONTAINS 130 CHARACTERS.
       01  PRINT-AREA                PIC X(130).

       WORKING-STORAGE SECTION.

       01  SWITCHES.
           05 SALESREP-EOF-SWITCH    PIC X VALUE "N".
              88 SALESREP-EOF        VALUE "Y".
           05 CUSTMAST-EOF-SWITCH    PIC X VALUE "N".
              88 CUSTMAST-EOF        VALUE "Y".
           05 FIRST-RECORD-SWITCH    PIC X VALUE "Y".
              88 FIRST-RECORD        VALUE "Y" FALSE "N".

       01  CONTROL-FIELDS.
           05 WS-CURRENT-BRANCH      PIC 99 VALUE ZERO.
           05 WS-PREVIOUS-BRANCH     PIC 99 VALUE ZERO.

       01  PRINT-FIELDS              PACKED-DECIMAL.
           05 PAGE-COUNT             PIC S9(3) VALUE ZERO.
           05 LINES-ON-PAGE          PIC S9(3) VALUE +55.
           05 LINE-COUNT             PIC S9(3) VALUE +99.
           05 SPACE-CONTROL          PIC 9 VALUE 1.

       01  TOTAL-FIELDS               PACKED-DECIMAL.
           05 SALESREP-TOTAL-THIS-YTD PIC S9(6)V99 VALUE ZERO.
           05 SALESREP-TOTAL-LAST-YTD PIC S9(6)V99 VALUE ZERO.
           05 BRANCH-TOTAL-THIS-YTD   PIC S9(6)V99 VALUE ZERO.
           05 BRANCH-TOTAL-LAST-YTD   PIC S9(6)V99 VALUE ZERO.
           05 GRAND-TOTAL-THIS-YTD    PIC S9(7)V99 VALUE ZERO.
           05 GRAND-TOTAL-LAST-YTD    PIC S9(7)V99 VALUE ZERO.

       01  CALC-FIELDS               PACKED-DECIMAL.
           05 CHANGE-AMOUNT          PIC S9(7)V99 VALUE ZERO.

       01  CURRENT-DATE-AND-TIME.
           05 CD-YEAR                PIC 9(4).
           05 CD-MONTH               PIC 9(2).
           05 CD-DAY                 PIC 9(2).
           05 CD-HOURS               PIC 9(2).
           05 CD-MINUTES             PIC 9(2).
           05 FILLER                 PIC X(9).

       01  HEADING-LINE-1.
           05 FILLER          PIC X(7)  VALUE "DATE:  ".
           05 HL1-MONTH       PIC 9(2).
           05 FILLER          PIC X(1)  VALUE "/".
           05 HL1-DAY         PIC 9(2).
           05 FILLER          PIC X(1)  VALUE "/".
           05 HL1-YEAR        PIC 9(4).
           05 FILLER          PIC X(26) VALUE SPACE.
           05 FILLER          PIC X(20) VALUE "YEAR-TO-DATE SALES R".
           05 FILLER          PIC X(31) VALUE "EPORT".
           05 FILLER          PIC X(6)  VALUE "PAGE: ".
           05 HL1-PAGE-NUMBER PIC ZZZ9.
           05 FILLER          PIC X(26) VALUE SPACE.

       01  HEADING-LINE-2.
           05 FILLER                 PIC X(7)  VALUE "TIME:  ".
           05 HL2-HOURS              PIC 9(2).
           05 FILLER                 PIC X(1)  VALUE ":".
           05 HL2-MINUTES            PIC 9(2).
           05 FILLER                 PIC X(82) VALUE SPACE.
           05 FILLER                 PIC X(7)  VALUE "RPT6000".
           05 FILLER                 PIC X(29) VALUE SPACE.

       01  HEADING-LINE-3.
           05  FILLER           PIC X(54)  VALUE SPACES.
           05  FILLER           PIC X(19)  VALUE "SALES         SALES".
           05  FILLER           PIC X(8)   VALUE SPACES.
           05  FILLER           PIC X(17)  VALUE "CHANGE     CHANGE".
           05  FILLER           PIC X(32)  VALUE SPACE.

       01  HEADING-LINE-4.
           05  FILLER         PIC X(17)  VALUE "BRANCH   SALESREP".
           05  FILLER         PIC X(13)  VALUE SPACES.
           05  FILLER         PIC X(8)   VALUE "CUSTOMER".
           05  FILLER         PIC X(14)  VALUE SPACES.
           05  FILLER         PIC X(22)  VALUE "THIS YTD      LAST YTD".
           05  FILLER         PIC X(7)   VALUE SPACES.
           05  FILLER         PIC X(18)  VALUE "AMOUNT     PERCENT".
           05  FILLER         PIC X(31)  VALUE SPACE.

       01  HEADING-LINE-5.
           05  FILLER           PIC X(6)   VALUE ALL '-'.
           05  FILLER           PIC X(1)   VALUE SPACE.
           05  FILLER           PIC X(13)  VALUE ALL '-'.
           05  FILLER           PIC X(1)   VALUE SPACE.
           05  FILLER           PIC X(26)   VALUE ALL '-'.
           05  FILLER           PIC X(3)   VALUE SPACE.
           05  FILLER           PIC X(11)  VALUE ALL '-'.
           05  FILLER           PIC X(3)   VALUE SPACE.
           05  FILLER           PIC X(11)  VALUE ALL '-'.
           05  FILLER           PIC X(4)   VALUE SPACE.
           05  FILLER           PIC X(11)  VALUE ALL '-'.
           05  FILLER           PIC X(2)   VALUE SPACE.
           05  FILLER           PIC x(7)   VALUE ALL '-'.
           05  FILLER           PIC X(31)  VALUE SPACE.

       01  CUSTOMER-LINE.
           05 FILLER                 PIC X(2)  VALUE SPACE.
           05 CL-BRANCH-NUMBER       PIC X(2).
           05 FILLER                 PIC X(3)  VALUE SPACE.
           05 CL-SALESREP-NUMBER     PIC X(2).
           05 FILLER                 PIC X(1)  VALUE SPACE.
           05 CL-SALESREP-NAME       PIC X(10).
           05 FILLER                 PIC X(1)  VALUE SPACE.
           05 CL-CUSTOMER-NUMBER     PIC X(5).
           05 FILLER                 PIC X(1)  VALUE SPACE.
           05 CL-CUSTOMER-NAME       PIC X(20).
           05 FILLER                 PIC X(6)  VALUE SPACE.
           05 CL-SALES-THIS-YTD      PIC ZZ,ZZ9.99-.
           05 FILLER                 PIC X(4)  VALUE SPACE.
           05 CL-SALES-LAST-YTD      PIC ZZ,ZZ9.99-.
           05 FILLER                 PIC X(4)  VALUE SPACE.
           05 CL-CHANGE-AMOUNT       PIC ZZ,ZZ9.99-.
           05 FILLER                 PIC X(2)  VALUE SPACE.
           05 CL-CHANGE-PERCENT      PIC +++9.9.
           05 CL-CHANGE-PERCENT-R    REDEFINES CL-CHANGE-PERCENT
                                     PIC X(6).
           05 FILLER                 PIC X(31) VALUE SPACE.

       01  SALESREP-TOTAL-LINE.
           05 FILLER                 PIC X(36) VALUE SPACE.
           05 FILLER                 PIC X(16) VALUE "SALESREP TOTAL".
           05 STL-SALES-THIS-YTD     PIC $$$,$$9.99-.
           05 FILLER                 PIC X(3)  VALUE SPACE.
           05 STL-SALES-LAST-YTD     PIC $$$,$$9.99-.
           05 FILLER                 PIC X(3)  VALUE SPACE.
           05 STL-CHANGE-AMOUNT      PIC $$$,$$9.99-.
           05 FILLER                 PIC X(2)  VALUE SPACE.
           05 STL-CHANGE-PERCENT     PIC +++9.9.
           05 STL-CHANGE-PERCENT-R   REDEFINES STL-CHANGE-PERCENT
                                     PIC X(6).
           05 FILLER                 PIC X(31) VALUE "*".

       01  BRANCH-TOTAL-LINE.
           05 FILLER                 PIC X(36) VALUE SPACE.
           05 FILLER                 PIC X(16) VALUE " BRANCH TOTAL".
           05 BTL-SALES-THIS-YTD     PIC $$$,$$9.99-.
           05 FILLER                 PIC X(3)  VALUE SPACE.
           05 BTL-SALES-LAST-YTD     PIC $$$,$$9.99-.
           05 FILLER                 PIC X(3)  VALUE SPACE.
           05 BTL-CHANGE-AMOUNT      PIC $$$,$$9.99-.
           05 FILLER                 PIC X(2)  VALUE SPACE.
           05 BTL-CHANGE-PERCENT     PIC +++9.9.
           05 BTL-CHANGE-PERCENT-R   REDEFINES BTL-CHANGE-PERCENT
                                     PIC X(6).
           05 FILLER                 PIC X(31) VALUE "**".

       01  GRAND-TOTAL-LINE.
           05 FILLER                 PIC X(36) VALUE SPACE.
           05 FILLER                 PIC X(14) VALUE " GRAND TOTAL".
           05 GTL-SALES-THIS-YTD     PIC $,$$$,$$9.99-.
           05 FILLER                 PIC X(1)  VALUE SPACE.
           05 GTL-SALES-LAST-YTD     PIC $,$$$,$$9.99-.
           05 FILLER                 PIC X(1)  VALUE SPACE.
           05 GTL-CHANGE-AMOUNT      PIC $,$$$,$$9.99-.
           05 FILLER                 PIC X(2)  VALUE SPACE.
           05 GTL-CHANGE-PERCENT     PIC +++9.9.
           05 GTL-CHANGE-PERCENT-R   REDEFINES GTL-CHANGE-PERCENT
                                     PIC X(6).
           05 FILLER                 PIC X(31) VALUE "***".


       PROCEDURE DIVISION.

       000-PREPARE-SALES-REPORT.
           OPEN INPUT  I_CUSTMAST
                OUTPUT O_RPT6000

           PERFORM 230-PRINT-HEADINGS
           PERFORM 210-READ-CUSTOMER-RECORD

           IF CUSTMAST-EOF-SWITCH = "N"
               MOVE CM-BRANCH-NUMBER TO WS-PREVIOUS-BRANCH
           END-IF

           PERFORM UNTIL CUSTMAST-EOF-SWITCH = "Y"
               PERFORM 220-PROCESS-CUSTOMER-RECORD
               PERFORM 210-READ-CUSTOMER-RECORD
           END-PERFORM

           PERFORM 400-PRINT-BRANCH-TOTAL
           PERFORM 300-PRINT-GRAND-TOTALS

           CLOSE I_CUSTMAST O_RPT6000
           STOP RUN.

       100-FORMAT-REPORT-HEADING.
           MOVE FUNCTION CURRENT-DATE TO CURRENT-DATE-AND-TIME.
           MOVE CD-MONTH   TO HL1-MONTH.
           MOVE CD-DAY     TO HL1-DAY.
           MOVE CD-YEAR    TO HL1-YEAR.
           MOVE CD-HOURS   TO HL2-HOURS.
           MOVE CD-MINUTES TO HL2-MINUTES.

       200-LOAD-SALESREP-TABLE.

           PERFORM
              WITH TEST AFTER
              VARYING SRT-INDEX FROM 1 BY 1
              UNTIL SALESREP-EOF
                 OR SRT-INDEX = 100
                 PERFORM 210-READ-SALESREP-TABLE-RECORD
                 IF NOT SALESREP-EOF
                    MOVE SM-SALESREP-NUMBER
                        TO SALESREP-NUMBER (SRT-INDEX)
                    MOVE SM-SALESREP-NAME
                        TO SALESREP-NAME (SRT-INDEX)
                 END-IF
           END-PERFORM.


        210-READ-SALESREP-TABLE-RECORD.

           READ INPUT-SALESREP
              AT END
                 SET SALESREP-EOF TO TRUE
           END-READ.


       300-PREPARE-SALES-LINES.
           PERFORM 310-READ-CUSTOMER-RECORD.
           EVALUATE TRUE
               WHEN CUSTMAST-EOF
                   PERFORM 355-PRINT-SALESREP-LINE
                   PERFORM 360-PRINT-BRANCH-LINE
               WHEN FIRST-RECORD
                   PERFORM 320-PRINT-CUSTOMER-LINE
                   MOVE "N" TO FIRST-RECORD-SWITCH
                   MOVE CM-SALESREP-NUMBER TO OLD-SALESREP-NUMBER
                   MOVE CM-BRANCH-NUMBER   TO OLD-BRANCH-NUMBER
               WHEN CM-BRANCH-NUMBER > OLD-BRANCH-NUMBER
                   PERFORM 355-PRINT-SALESREP-LINE
                   PERFORM 360-PRINT-BRANCH-LINE
                   PERFORM 320-PRINT-CUSTOMER-LINE
                   MOVE CM-SALESREP-NUMBER TO OLD-SALESREP-NUMBER
                   MOVE CM-BRANCH-NUMBER   TO OLD-BRANCH-NUMBER
               WHEN CM-SALESREP-NUMBER > OLD-SALESREP-NUMBER
                   PERFORM 355-PRINT-SALESREP-LINE
                   PERFORM 320-PRINT-CUSTOMER-LINE
                   MOVE CM-SALESREP-NUMBER TO OLD-SALESREP-NUMBER
               WHEN OTHER
                   PERFORM 320-PRINT-CUSTOMER-LINE
           END-EVALUATE.

        310-READ-CUSTOMER-RECORD.
           READ INPUT-CUSTMAST
               AT END
                   SET CUSTMAST-EOF TO TRUE
           END-READ.

       320-PRINT-CUSTOMER-LINE.
           IF LINE-COUNT > LINES-ON-PAGE
               PERFORM 330-PRINT-HEADING-LINES
           END-IF

           IF FIRST-RECORD
               MOVE CM-BRANCH-NUMBER   TO CL-BRANCH-NUMBER
               MOVE CM-SALESREP-NUMBER TO CL-SALESREP-NUMBER
               PERFORM 325-MOVE-SALESREP-NAME
           ELSE
               IF CM-BRANCH-NUMBER > OLD-BRANCH-NUMBER
                   MOVE CM-BRANCH-NUMBER   TO CL-BRANCH-NUMBER
                   MOVE CM-SALESREP-NUMBER TO CL-SALESREP-NUMBER
               ELSE
                   IF CM-SALESREP-NUMBER > OLD-SALESREP-NUMBER
                       MOVE SPACES TO CL-BRANCH-NUMBER
                       MOVE CM-SALESREP-NUMBER TO CL-SALESREP-NUMBER
                       PERFORM 325-MOVE-SALESREP-NAME
                   ELSE
                       MOVE SPACES TO CL-BRANCH-NUMBER
                       MOVE SPACES TO CL-SALESREP-NUMBER
                       MOVE SPACES TO CL-SALESREP-NAME
                   END-IF
               END-IF
           END-IF

           MOVE CM-CUSTOMER-NUMBER TO CL-CUSTOMER-NUMBER.
           MOVE CM-CUSTOMER-NAME   TO CL-CUSTOMER-NAME.
           MOVE CM-SALES-THIS-YTD  TO CL-SALES-THIS-YTD.
           MOVE CM-SALES-LAST-YTD  TO CL-SALES-LAST-YTD.

           COMPUTE CHANGE-AMOUNT =
               CM-SALES-THIS-YTD - CM-SALES-LAST-YTD.
           MOVE CHANGE-AMOUNT TO CL-CHANGE-AMOUNT.

           IF CM-SALES-LAST-YTD = ZERO
               MOVE "  N/A " TO CL-CHANGE-PERCENT-R
           ELSE
               COMPUTE CL-CHANGE-PERCENT ROUNDED =
                   CHANGE-AMOUNT * 100 / CM-SALES-LAST-YTD
                   ON SIZE ERROR
                       MOVE "OVRFLW" TO CL-CHANGE-PERCENT-R
               END-COMPUTE
           END-IF.
           MOVE CUSTOMER-LINE TO PRINT-AREA.
           MOVE 1 TO SPACE-CONTROL.
           PERFORM 350-WRITE-REPORT-LINE.

           ADD CM-SALES-THIS-YTD TO SALESREP-TOTAL-THIS-YTD.
           ADD CM-SALES-LAST-YTD TO SALESREP-TOTAL-LAST-YTD.
           ADD CM-SALES-THIS-YTD TO BRANCH-TOTAL-THIS-YTD.
           ADD CM-SALES-LAST-YTD TO BRANCH-TOTAL-LAST-YTD.

       325-MOVE-SALESREP-NAME.

           SET SRT-INDEX TO 1.
           SEARCH SALESREP-GROUP
              AT END
                 MOVE "UNKNOWN" TO CL-SALESREP-NAME
              WHEN SALESREP-NUMBER (SRT-INDEX) = CM-SALESREP-NUMBER
                 MOVE SALESREP-NAME (SRT-INDEX) TO CL-SALESREP-NAME
           END-SEARCH.    


       360-PRINT-BRANCH-LINE.


           IF BRANCH-TOTAL-LAST-YTD = ZERO
                MOVE "  N/A " TO BTL-CHANGE-PERCENT-READ
           ELSE
                COMPUTER BTL-CHANGE-PERCENT ROUNDED =
                    CHANGE-AMOUNT * 100 / BRANCH-TOTAL-LAST-YTD
                    ON SIZE ERROR
                    MOVE "OVRFLW" TO BTL-CHANGE-PERCENT-READ


           ADD BRANCH-TOTAL-THIS-YTD TO GRAND-TOTAL-THIS-YTDD.
           ADD BRANCH-TOTAL-LAST-YTD TO GRAND-TOTAL-LAST-YTD.
           INITIALIZE BRANCH-TOTAL-THIS-YTD
                    BRANCH-TOTAL-LAST-YTD.

       400-PRINT-BRANCH-TOTAL.
           MOVE SPACES TO PRINT-AREA
           WRITE PRINT-AREA

           IF BT-LAST-YTD NOT = ZERO
               COMPUTE WS-CHANGE-PERCENT =
                   (BT-CHANGE / BT-LAST-YTD) * 100
               IF WS-CHANGE-PERCENT > 9999.9 OR
                  WS-CHANGE-PERCENT < -9999.9
                   MOVE "OVRFLW" TO BTL-CHANGE-PERCENT-R
               ELSE
                   MOVE WS-CHANGE-PERCENT TO BTL-CHANGE-PERCENT
               END-IF
           ELSE
               MOVE "N/A   " TO BTL-CHANGE-PERCENT-R
           END-IF

           MOVE BT-THIS-YTD  TO BTL-SALES-THIS-YTD
           MOVE BT-LAST-YTD  TO BTL-SALES-LAST-YTD
           MOVE BT-CHANGE    TO BTL-CHANGE-AMOUNT

           MOVE BRANCH-TOTAL-LINE TO PRINT-AREA
           WRITE PRINT-AREA.

       410-CLEAR-BRANCH-TOTALS.
           MOVE ZERO TO BT-THIS-YTD
           MOVE ZERO TO BT-LAST-YTD
           MOVE ZERO TO BT-CHANGE.
